src/cf/Documents/вогАнкета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>вогАнкета</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.вогРезультатыОпросов</xr:Item>
				<xr:Item>InformationRegister.вогИзображенияСторонПанелейРеспондентов</xr:Item>
				<xr:Item>InformationRegister.вогКоличествоКоллекцийБрендов</xr:Item>
				<xr:Item>InformationRegister.вогСтендыВТорговыхТочках</xr:Item>
				<xr:Item>InformationRegister.вогПанелиВТорговыхТочках</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Респондент</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.вогВариантыОпросов</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОпроса</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.вогВариантыОпросов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.вогАнкета</v8:Type>
						<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.CRM_БизнесПроцесс</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполненоУтверждение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданоИзОбъекта</Name>
					<Comment>Служебный реквизит для запуска бизнес процесса</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТаблицаКлассификаторов</Name>
					<Comment>// Тищенко В.В. Классификаторы формируется на форме. При записи докумеента не интерактивно нет данных</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогШаблоныСтатусов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсииОпроса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭлементарныйВопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляАнкетирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВопросыДляАнкетирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткрытыйОтвет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветПолучен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставОпроса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектОпроса</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогОбъектыОпроса</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогВариантыОтвета</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогВопросы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогТипыЗначенийПараметровВопросов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветПолучен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставКлассификаторов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗначениеКлассификатора</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_ЗначенияКлассификаторов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветПолучен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительнаяИнформацияВопросов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.вогДополнительнаяИнформацияАнкета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.вогДополнительнаяИнформацияАнкета</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогВопросы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительнаяИнформацияВариантовОтвета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.вогДополнительнаяИнформацияАнкета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.вогДополнительнаяИнформацияАнкета</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантОтвета</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.вогОбъектыОпроса</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СоставОпросаПрисоединенныеФайлы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПрисоединенныйФайл</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогАнкетаПрисоединенныеФайлы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.вогВопросы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДанныеНовогоФайла</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизитыРеспондента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CRM_ДополнительныеРеквизитыКлассификаторов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CRM_ДополнительныеРеквизитыКлассификаторов</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветПолучен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформацияОписаниеДополнительныхРеквизитов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяРеквизита</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТолькоРоссийский</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипНомер</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выводить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Родитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Долгота</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Широта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>6</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Documents/вогАнкета/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// ++ VOG Солодов В.В. 08.08.2019 task 521
Процедура ЗаписатьВыполнениеОбработчика(АнкетаОбъект, ВидОбработчика, Знач Вопрос = Неопределено, Успешно) Экспорт
	
	Если АнкетаОбъект.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Вопрос = Неопределено Тогда
		Вопрос = Справочники.вогВопросы.ПустаяСсылка();
	КонецЕсли;
	
	МенеджерЗаписи 						= РегистрыСведений.вогЛогиАнкет.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период 				= ТекущаяДатаСеанса();
	МенеджерЗаписи.Анкета 				= АнкетаОбъект.Ссылка;
	МенеджерЗаписи.Статус 				= АнкетаОбъект.Статус;
	МенеджерЗаписи.ВидОбработчика 		= ВидОбработчика;
	МенеджерЗаписи.Вопрос 				= Вопрос;
	МенеджерЗаписи.Пользователь 		= Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Успешно 				= Успешно;
	МенеджерЗаписи.КоличествоДвижений 	= АнкетаОбъект.Движения.вогРезультатыОпросов.Количество();
	МенеджерЗаписи.Проведен 			= АнкетаОбъект.Проведен;
	
	МенеджерЗаписи.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры // -- VOG Солодов В.В. 08.08.2019

#КонецОбласти

#КонецЕсли

// ++ VOG Солодов В.В. 24.01.2020 CRM-106
#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
// 	КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	

КонецПроцедуры
// -- VOG Солодов В.В. 24.01.2020

Функция Печать(КоличествоСтрокВКолонке, КоличествоКолонок, Таблица) Экспорт
	//Таблица = ЭтотОбъект.ТаблицаВопроса.Выгрузить();
	
	
	
	Таб = Новый ТабличныйДокумент;
	Таб.Очистить();
	
	Макет = ПолучитьМакет("МакетСписокАртикулов");
	
	
	
	СтрокиТаблицыМассив = Новый Массив(КоличествоСтрокВКолонке, КоличествоКолонок);
	
	ПеренеслиВНовуюКолонку = 0;
	Перенесли              = 0;
	//Для Каждого Стр из Таблица Цикл
	//Для к = 1 по КоличествоКолонок Цикл
	//	Переносим = Ложь;
	//	ПеренеслиВНовуюКолонку = ПеренеслиВНовуюКолонку + Перенесли;
	//	Перенесли = 0;
	//	Для н = 1 по КоличествоСтрокВКолонке  Цикл
	//		    НомерСтроки = (к-1)*КоличествоСтрокВКолонке + н - 1 - ПеренеслиВНовуюКолонку;
	//			Если НомерСтроки>=Таблица.Количество() или Переносим Тогда
	//				СтрокиТаблицыМассив[н-1][к-1] = Неопределено;
	//				Перенесли = Перенесли+1;
	//			Иначе
	//				СтрокаТаблицы = Таблица.Получить(НомерСтроки);
	//				
	//				Если СтрокаТаблицы.Дизайн Тогда
	//					Если (н-1)+СтрокаТаблицы.Количество>КоличествоСтрокВКолонке Тогда
	//						 СтрокиТаблицыМассив[н-1][к-1] = Неопределено;
	//                         Переносим = Истина;
	//						 Перенесли = Перенесли+1;
	//					 Иначе
	//						СтрокиТаблицыМассив[н-1][к-1] = СтрокаТаблицы; 
	//					КонецЕслИ;
	//				Иначе
	//					
	//					СтрокиТаблицыМассив[н-1][к-1] = СтрокаТаблицы;
	//				КонецЕсли;
	//			КонецЕсли;
	//			
	//		КонецЦикла;
	//КонецЦикла;
	
	
	//КонецЦикла;
	
	
	
	ОбластьШапка   = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьПробелМеждуКолонками = Макет.ПолучитьОбласть("ПробелМуждуКолонок");
	ОбластьСтрок   = Макет.ПолучитьОбласть("Строка");
	ОбластьАртикул = Макет.ПолучитьОбласть("ОбластьАртикул");
	ОбластьДизайн  = Макет.ПолучитьОбласть("ОбластьДизайн");
	ОбластьБренд   = Макет.ПолучитьОбласть("ОбластьБренд");
	
	ОбщееКоличествоСтрок = Таблица.Количество();
	КоличествоНаСтранице = КоличествоКолонок * КоличествоСтрокВКолонке;
	КолНаСтранице = 0;
	СтрокВКолонке = КоличествоСтрокВКолонке;
	УжеВывели = 0;
	КолСтраниц = ОбщееКоличествоСтрок / КоличествоНаСтранице;
	Таб.Вывести(ОбластьШапка);
	Если Цел(КолСтраниц) < КолСтраниц Тогда
		КолСтраниц = Цел(КолСтраниц) + 1;
	КонецЕсли;	
	
	Для Страница = 1 По КолСтраниц Цикл
		
		Для Строка = 1 По СтрокВКолонке Цикл
			
			// Выводим основную часть
			ПолучСтрока = Таблица[КолНаСтранице + Строка - 1];
			
			
			
			
			
			
			Если ПолучСтрока.Бренд Тогда
				ОбластьСтрок = ОбластьБренд;
			ИначеЕсли ПолучСтрока.Дизайн Тогда
				ОбластьСтрок = ОбластьДизайн;
			Иначе
				ОбластьСтрок = ОбластьАртикул;
			КонецЕсли;
			
			
			
			//			ОбластьСтрок.Параметры.НомерСтроки = 1;
			ОбластьСтрок.Параметры.Данные = ПолучСтрока.Артикул;
			
			Таб.Вывести(ОбластьСтрок);
			
			// Добавяем колонки
			Если КоличествоКолонок > 1 Тогда
				
				СуммаКолонки = 0;
				
				Для Кол = 1 По (КоличествоКолонок - 1) Цикл
					//Таб.Присоединить(ОбластьПробелМеждуКолонками);
					
					Попытка
						// Добавляем остальные части
						Если Таблица.Количество()< СуммаКолонки+ КолНаСтранице + СтрокВКолонке + Строка - 1 Тогда
							Прервать;
						КонецЕсли;
						ПолучСтрока = Таблица[СуммаКолонки+ КолНаСтранице + СтрокВКолонке + Строка - 1];
						Если ПолучСтрока.Бренд Тогда
							ОбластьСтрок = ОбластьБренд;
						ИначеЕсли ПолучСтрока.Дизайн Тогда
							ОбластьСтрок = ОбластьДизайн;
						Иначе
							ОбластьСтрок = ОбластьАртикул;
						КонецЕсли;
						
						
						//	ОбластьСтрок.Параметры.НомерСтроки = 1;
						ОбластьСтрок.Параметры.Данные = ПолучСтрока.Артикул;
						
						Таб.Присоединить(ОбластьСтрок);
						
						СуммаКолонки = СуммаКолонки + СтрокВКолонке;
					Исключение
						
					КонецПопытки;
					
				КонецЦикла;
			КонецЕслИ;
		КонецЦикла;
		
		КолНаСтранице = КолНаСтранице + КоличествоНаСтранице;
		Таб.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
	
	Возврат Таб;
КонецФункции

#КонецОбласти

#Область СозданиеОбъектов

Функция ВыполнитьСозданиеОбъектов(АнкетаСсылка, Отказ, ВходныеДанные) Экспорт
	
КонецФункции

Функция ПодготовитьСтруктурыСоздаваемыхОбъектов(АнкетаСсылка, Отказ, ВходныеДанные) Экспорт
	
КонецФункции

Функция ПодготовитьСтруктуруОбъекта(АнкетаСсылка, Отказ, ВходныеДанные) Экспорт
	
КонецФункции

#КонецОбласти

#Область ЗаполнениеАнкеты

&НаСервере
Процедура ВыполнитьЗаполнениеТаблицОтветов(Объект, ДанныеДляЗаполнения, ТаблицаЭлементарныеВопросы) Экспорт
	
	Если ДанныеДляЗаполнения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого СтрСтравочника из ДанныеДляЗаполнения Цикл 
		
		ИмяСправочника = СтрСтравочника.Ключ; 
		
		Если НРег(ИмяСправочника) = НРег("Клиент") Тогда
			ИмяСправочника = "Партнеры";
		ИначеЕсли НРег(ИмяСправочника) = НРег("КонтактноеЛицо") Тогда
			ИмяСправочника = "КонтактныеЛицаПартнеров";
		ИначеЕсли НРег(ИмяСправочника) = НРег("ТорговаяТочка") Тогда
			ИмяСправочника = "вогТорговыеТочки";
		ИначеЕсли НРег(ИмяСправочника) = НРег("ЮрЛицо") Тогда
			ИмяСправочника = "вогЮридическиеЛица";
			
		ИначеЕсли НРег(ИмяСправочника) = НРег("ВыбранныеКлассификаторы") Тогда
			
			Если СтрСтравочника.Значение = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Для Каждого ЗначениеКлассификатора Из СтрСтравочника.Значение Цикл 
				
				ПоискКлассификатор = Объект.СоставКлассификаторов.НайтиСтроки(Новый Структура("ЗначениеКлассификатора", ЗначениеКлассификатора));
				
				Если НЕ ПоискКлассификатор.Количество() Тогда
					НоваяСтрока = Объект.СоставКлассификаторов.Добавить();
					НоваяСтрока.ЗначениеКлассификатора = ЗначениеКлассификатора;
				КонецЕсли;
				
			КонецЦикла;
			
			Продолжить;
		Иначе 
			
			Продолжить;
		КонецЕсли;
		
		Для Каждого СтрКлючТипаПоля Из СтрСтравочника.Значение Цикл 
			
			Если НЕ СтрКлючТипаПоля.Ключ = "НайденныеДубли" Тогда
				
				ЗаполнитьДанныеАнкетыЕдиничнымиОтветами(Объект, СтрКлючТипаПоля.Значение, СтрКлючТипаПоля.Ключ, ИмяСправочника, ТаблицаЭлементарныеВопросы);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеАнкетыЕдиничнымиОтветами(Объект, ДанныеДляЗаполнения, ИмяПоля, ИмяСправочника, ТаблицаЭлементарныеВопросы)
	
	Для Каждого СтрИмяПоля Из ДанныеДляЗаполнения Цикл 
		
		ИтоговоеЗначение = СтрИмяПоля.Значение;
		
		Если ИтоговоеЗначение = Неопределено ИЛИ СокрЛП(ИтоговоеЗначение) = "" Тогда
			Продолжить;
		КонецЕсли;
		
		СтруктураПоискаЭлементарногоВопроса = Новый Структура;
		СтруктураПоискаЭлементарногоВопроса.Вставить("CRM_ИмяСправочника", ИмяСправочника);
		
		Если ИмяПоля = "КонтактнаяИнформация" Тогда
			СтруктураПоискаЭлементарногоВопроса.Вставить("CRM_ВидКонтактнойИнформации", СтрИмяПоля.Ключ);
		Иначе 
			СтруктураПоискаЭлементарногоВопроса.Вставить("CRM_ИмяРеквизита", СтрИмяПоля.Ключ);
		КонецЕсли;
		
		ПоискСтрокВопроса = ТаблицаЭлементарныеВопросы.НайтиСтроки(СтруктураПоискаЭлементарногоВопроса);
		
		Если ПоискСтрокВопроса.Количество() Тогда
			СтрокаВопроса = ПоискСтрокВопроса.Получить(0);
			
			ПоискСтрокиВопроса = Объект.Состав.НайтиСтроки(Новый Структура("ЭлементарныйВопрос", СтрокаВопроса.ЭлементарныйВопрос));
			Если ПоискСтрокиВопроса.Количество() Тогда
				ПоискСтрокиВопроса = ПоискСтрокиВопроса.Получить(0);
			Иначе 
				ПоискСтрокиВопроса = Объект.Состав.Добавить();
				ПоискСтрокиВопроса.ЭлементарныйВопрос = СтрокаВопроса.ЭлементарныйВопрос;
			КонецЕсли;
			
			ПоискСтрокиВопроса.Ответ = ИтоговоеЗначение;
			Продолжить; // Найдено  в элементарных вопросах, дальше не смотрим
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// ++ Тищенко В.В. 28.02.2019
	// Добавлен в пердставление реквизит статус	
	Представление = ПолучитьПредставлениеОбъекта(Данные.ВариантОпроса, Данные.Номер, Данные.Дата,данные.Статус, Данные.Респондент);
	// -- Тищенко В.В. 
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Поля.Добавить("Дата");
	Поля.Добавить("Номер");
	Поля.Добавить("ВариантОпроса");
	// ++ Тищенко В.В. 28.02.2019
	// Добавлен в пердставление реквизит статус
	Поля.Добавить("Статус");
	// -- Тищенко В.В. 
	Поля.Добавить("Респондент");//+ VOG Иванов С.А. 04.12.2019 ID заявки: 000000961
	
КонецПроцедуры

Функция ПолучитьПредставлениеОбъекта(ВариантОпроса, Номер, Дата, Статус, Респондент = "") Экспорт
	                                                  
	Возврат СтрШаблон("%1 %2 № %3 от %4  статус: %5 ", Респондент, ВариантОпроса, Номер, Дата, Статус); //+ VOG Иванов С.А. 03.12.2019 ID заявки: 000000961
	
КонецФункции
